OpenDTEF-v1812/tutorials/multiphase/multiphaseInterFoam/laminar/damBreak4phase/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.water 0
    volScalarFieldValue alpha.oil 0
    volScalarFieldValue alpha.mercury 0
    volVectorFieldValue U (0 0 0)
);

regions
(
    boxToCell
    {
        box (0 0 -1) (0.1461 0.292 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue alpha.oil 0
            volScalarFieldValue alpha.mercury 0
            volScalarFieldValue alpha.air 0
        );
    }
    boxToCell
    {
        box (0.1461 0 -1) (0.2922 0.292 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue alpha.oil 1
            volScalarFieldValue alpha.mercury 0
            volScalarFieldValue alpha.air 0
        );
    }
    boxToCell
    {
        box (0 0 -1) (0.1461 0.1 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue alpha.oil 0
            volScalarFieldValue alpha.mercury 1
            volScalarFieldValue alpha.air 0
        );
    }
);


// ************************************************************************* //
